# Movies Tonight Part 3: SQL DML

In [65]:
%load_ext sql
%sql sqlite:///Movies.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @Movies.db'

1. **Load the `DATASET.csv` file into the `Movies.db` database.**  
    - Import the CSV file to create a new table called `DATASET`. Follow the example [here](http://www.sqlitetutorial.net/sqlite-import-csv/).
    - Use a [`PRAGMA table-info` pseudo-query](https://www.sqlite.org/pragma.html#pragma_table_info) to inspect the design of the new table. [How are we going to handle dates](https://www.sqlite.org/datatype3.html)?

In [63]:
YOUR CODE HERE

SyntaxError: invalid syntax (<ipython-input-63-1f6482a73065>, line 1)

2. **Populate the tables with data.**  

    - Use `INSERT ... SELECT ...` queries to extract data from `DATASET` for each table of your other tables. 
    - Start with the strong entities before moving on to the weak ones. Be sure to always select distinct     values. 
    - Foreign Keys get special treatment. You will have to use JOINs to pick up the PKs from the other side of the relationships. (As in Part 1, use the fact that movie names, theater names, and people names are always unique in our source data. That way you can use then for the JOIN columns. 
    - If you have to start over, then rerun your DDL queries from Part 2.

In [66]:
%%sql
INSERT INTO MOVIES (MTitle, Rating)
SELECT DISTINCT MTitle, Rating
FROM DATASET;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
23 rows affected.

[]

In [67]:
%%sql
INSERT INTO THEATERS (TName, Phone, Location)
SELECT DISTINCT TName, Phone , Location
FROM DATASET;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
9 rows affected.

[]

3. **Check your work.**  
There are 9 theaters, 23 movies, 152 artists, 131 shows, and 161 credits.

In [122]:
%%sql
INSERT INTO MOVIES (MTitle, Rating)
SELECT DISTINCT MTitle, Rating
FROM DATASET;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
23 rows affected.

[]

In [125]:
%%sql
INSERT INTO THEATERS (TName, Phone, Location)
SELECT DISTINCT TName, Phone, Location
FROM DATASET;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
9 rows affected.

[]

In [68]:
%%sql
INSERT INTO ARTISTS (AName)
SELECT DISTINCT CName
FROM DATASET;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
153 rows affected.

[]

In [115]:
%%sql
INSERT INTO CREDITS (MID, AID, CCode)
SELECT DISTINCT MID, AID, CCode
FROM DATASET 
    JOIN MOVIES ON (MOVIES.MTitle=DATASET.MTitle)
    JOIN ARTISTS ON (ARTISTS.ANAME=DATASET.CNAME);

 * sqlite:///Movies.db
   sqlite:///Movies.db;
972 rows affected.

[]

In [155]:
%%sql
INSERT INTO SHOWS (STime,MID, TID)
SELECT DISTINCT STime, MID, TID
FROM DATASET
JOIN MOVIES ON (MOVIES.MTitle=DATASET.MTitle)
JOIN THEATERS ON (THEATERS.TName=DATASET.TName)
;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
(sqlite3.OperationalError) no such column: STime [SQL: 'INSERT INTO SHOWS (STime,MID, TID)\nSELECT DISTINCT STime, MID, TID\nFROM DATASET\nJOIN MOVIES ON (MOVIES.MTitle=DATASET.MTitle)\nJOIN THEATERS ON (THEATERS.TName=DATASET.TName)\n;'] (Background on this error at: http://sqlalche.me/e/e3q8)

4. **Now check the source data.**  
There are actually 13 duplicate rows in the original source data! Can you spot them? Write a SQL query that counts how many times each (MTitle, TName, Showtime, CCode, and CName) appears. Which ones appear more than once?

In [152]:
%%sql
SELECT MTitle, TName, Showtime, CCode, CName
FROM DATASET
GROUP BY MTitle, TName, Showtime, CCode, CName
HAVING COUNT (*) > 1;

 * sqlite:///Movies.db
   sqlite:///Movies.db;
Done.

[('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Greg Kinnear'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Hector Elizondo'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Jon Seda'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Laurie Metcalf'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Maria Pitillo'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Roscoe Lee Browne'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'A', 'Tim Conway'),
 ('Dear God', 'SOCAL Canyon Springs Cinema', '9:00 PM', 'D', 'Garry Marshall'),
 ('High School High', 'United Artists Riverside (Galleria) Tyler Mall', '9:00 PM', 'A', 'Jon Lovitz'),
 ('High School High', 'United Artists Riverside (Galleria) Tyler Mall', '9:00 PM', 'A', 'Mekhi Phifer'),
 ('High School High', 'United Artists Riverside (Galleria) Tyler Mall', '9:00 PM', 'A', 'Tia Carrera'),
 ('High School High', 'United Artists Riverside (Galleria) Tyler Mall', '9:00 PM', 'A', 'and Louise Fletcher'),
 ('High School High', 'United Artists Riverside (Galleria) Tyler Mall', '9:00 PM', 'D', 'Hart Bochner')]

5. **Drop the `DATASET` table.**  
We don't need it anymore.

6. **Save, commit, and push your work to GitHub.**  
Use the commit summary comment "Completed Part 3".